# Binarization

## Remember that binarization only converts numerical data into 0 and 1 .

In [1]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split,cross_val_score
from sklearn.metrics import accuracy_score
from sklearn.compose import ColumnTransformer

In [2]:
df=pd.read_csv("train.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df=pd.read_csv("train.csv",usecols=["Age","Fare","SibSp","Parch","Survived"])

In [5]:
df.head()

   Survived   Age  SibSp  Parch     Fare
0         0  22.0      1      0   7.2500
1         1  38.0      1      0  71.2833
2         1  26.0      0      0   7.9250
3         1  35.0      1      0  53.1000
4         0  35.0      0      0   8.0500

In [6]:
df.isnull().sum()

Survived      0
Age         177
SibSp         0
Parch         0
Fare          0
dtype: int64

In [8]:
df.dropna(inplace=True)

In [11]:
df.shape

(714, 5)

In [10]:
df.head()

   Survived   Age  SibSp  Parch     Fare
0         0  22.0      1      0   7.2500
1         1  38.0      1      0  71.2833
2         1  26.0      0      0   7.9250
3         1  35.0      1      0  53.1000
4         0  35.0      0      0   8.0500

In [12]:
df["family"]=df["SibSp"]+df["Parch"]

In [13]:
df.head()

   Survived   Age  SibSp  Parch     Fare  family
0         0  22.0      1      0   7.2500       1
1         1  38.0      1      0  71.2833       1
2         1  26.0      0      0   7.9250       0
3         1  35.0      1      0  53.1000       1
4         0  35.0      0      0   8.0500       0

In [16]:
df.drop(columns=["SibSp","Parch"],inplace=True)

In [17]:
df.head()

   Survived   Age     Fare  family
0         0  22.0   7.2500       1
1         1  38.0  71.2833       1
2         1  26.0   7.9250       0
3         1  35.0  53.1000       1
4         0  35.0   8.0500       0

In [18]:
X=df.drop(columns=["Survived"])
Y=df["Survived"]

In [19]:
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,test_size=0.2,random_state=42)

In [20]:
X_train.head()

      Age     Fare  family
328  31.0  20.5250       2
73   26.0  14.4542       1
253  30.0  16.1000       1
719  33.0   7.7750       0
666  25.0  13.0000       0

### Without Binarization

In [21]:
clf=DecisionTreeClassifier()

clf.fit(X_train,Y_train)

Y_pred=clf.predict(X_test)

accuracy_score(Y_pred,Y_test)

0.6223776223776224

In [22]:
np.mean(cross_val_score(DecisionTreeClassifier(),X,Y,cv=10,scoring="accuracy"))

0.6485328638497653

### Applying Binarization

In [33]:
from sklearn.preprocessing import Binarizer

In [34]:
trf=ColumnTransformer([
    ("bin",Binarizer(copy=False),["family"])
],remainder="passthrough")

### We want changes in existing column that's why we set copy=False in the above function

In [35]:
X_train_trf=trf.fit_transform(X_train)
X_test_trf=trf.transform(X_test)

In [36]:
pd.DataFrame(X_train_trf,columns=["Family","Age","Fare"])

     Family   Age      Fare
0       1.0  31.0   20.5250
1       1.0  26.0   14.4542
2       1.0  30.0   16.1000
3       0.0  33.0    7.7750
4       0.0  25.0   13.0000
..      ...   ...       ...
566     1.0  46.0   61.1750
567     0.0  25.0   13.0000
568     0.0  41.0  134.5000
569     1.0  33.0   20.5250
570     0.0  33.0    7.8958

[571 rows x 3 columns]

In [37]:
clf1=DecisionTreeClassifier()
clf1.fit(X_train_trf,Y_train)
Y_pred2=clf1.predict(X_test_trf)

accuracy_score(Y_pred2,Y_test)

0.6223776223776224

In [38]:
X_trf=trf.transform(X)

np.mean(cross_val_score(DecisionTreeClassifier(),X_trf,Y,cv=10,scoring="accuracy"))

0.6332159624413145

# Conclude